### Note
* Instructions have been included for each segment. You do not have to follow them exactly, but they are included to help you think through the steps.

In [103]:
# Dependencies and Setup
import pandas as pd
import numpy as np
import os
# File to Load (Remember to Change These)
csv_file = os.path.join(os.getcwd(), 'purchase_data.csv')

In [104]:
# Read Purchasing File and store into Pandas data frame
purchase_data_df = pd.read_csv(csv_file)

In [105]:
purchase_data_df.head()

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44

In [106]:
unique_purchase_data_df=purchase_data_df.drop_duplicates(subset='SN', keep='first', inplace=False)
unique_purchase_data_df

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44
...,...,...,...,...,...,...,...
773,773,Hala31,21,Male,19,"Pursuit, Cudgel of Necromancy",1.02
774,774,Jiskjask80,11,Male,92,Final Critic,4.19
775,775,Aethedru70,21,Female,60,Wolf,3.54
777,777,Yathecal72,20,Male,67,"Celeste, Incarnation of the Corrupted",3.46
778,778,Sisur91,7,Male,92,Final Critic,4.19

In [107]:
## Player Count
player_count = len(purchase_data_df["SN"].unique())

In [108]:
# Display the total number of players
player_count

576

In [109]:
total_players_df = pd.DataFrame({"Total Players": [player_count]})

In [110]:
total_players_df

   Total Players
0            576

## Purchasing Analysis (Total)

* Run basic calculations to obtain number of unique items, average price, etc.


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [111]:
unique_item_count = len(purchase_data_df["Item ID"].unique())

In [112]:
unique_item_count

179

In [113]:
average_price = purchase_data_df['Price'].mean()

In [114]:
total_purchases = len(purchase_data_df['Purchase ID'])

In [115]:
total_purchases

780

In [116]:
total_revenue = purchase_data_df['Price'].sum()

In [117]:
total_revenue

2379.77

In [118]:
Sales_summary_df = pd.DataFrame(
    {"Unique Items Sold": [unique_item_count],
    "Average Sale Price": [average_price],
    "Total Number of Purchases": [total_purchases],
    "Total Revenue": [total_revenue]}
)

In [119]:
Sales_summary_df.style.format({'Average Sale Price':"${:,.2f}", 'Total Revenue': '${:,.2f}'})

## Gender Demographics

* Percentage and Count of Male Players


* Percentage and Count of Female Players


* Percentage and Count of Other / Non-Disclosed

In [120]:
#Genders of unique players
unique_gender_players_df= purchase_data_df.groupby('Gender')['SN'].nunique()

In [121]:
unique_gender_players_df

Gender
Female                    81
Male                     484
Other / Non-Disclosed     11
Name: SN, dtype: int64

In [122]:
#Create total purchase count by Gender data frame
purchases_by_gender_df = purchase_data_df.groupby(['Gender'])['SN'].count()
purchases_by_gender_df

Gender
Female                   113
Male                     652
Other / Non-Disclosed     15
Name: SN, dtype: int64

In [123]:
#Merge Genders of unique players and Total purchase data frames
combined_gender_df = pd.merge(unique_gender_players_df, purchases_by_gender_df, on = 'Gender')

In [124]:
#Rename columns
combined_gender_df = combined_gender_df.rename(columns={"SN_x": "Unique", "SN_y": "Total"})
combined_gender_df

                       Unique  Total
Gender
Female                     81    113
Male                      484    652
Other / Non-Disclosed      11     15

In [125]:
#Formula to calculate percentages
percent_of_genders_df= (combined_gender_df['Unique'] / player_count) * 100
percent_of_genders_df

Gender
Female                   14.062500
Male                     84.027778
Other / Non-Disclosed     1.909722
Name: Unique, dtype: float64

In [126]:
#Merge Player count by gender and percent data frames
percent_of_genders_df = pd.merge(unique_gender_players_df, percent_of_genders_df, on='Gender')
percent_of_genders_df= percent_of_genders_df.rename(columns={"SN_x": "Players", "SN_y": "Redundent"})

In [127]:
#Rename columns
percent_of_genders_df = percent_of_genders_df.rename(columns={"Players": "Number of Players", "Unique": "Percent of Players"})
percent_of_genders_df

                        SN  Percent of Players
Gender
Female                  81           14.062500
Male                   484           84.027778
Other / Non-Disclosed   11            1.909722

In [128]:
#Formating Data Frame
percent_of_genders_df.style.format({"Percent of Players":"{:.2f}"})


## Purchasing Analysis (Gender)

* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. by gender




* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [129]:
purchase_data_df

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56
2,2,Ithergue48,24,Male,92,Final Critic,4.88
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27
4,4,Iskosia90,23,Male,131,Fury,1.44
...,...,...,...,...,...,...,...
775,775,Aethedru70,21,Female,60,Wolf,3.54
776,776,Iral74,21,Male,164,Exiled Doomblade,1.63
777,777,Yathecal72,20,Male,67,"Celeste, Incarnation of the Corrupted",3.46
778,778,Sisur91,7,Male,92,Final Critic,4.19
779,779,Ennrian78,24,Male,50,Dawn,4.60

In [139]:
#Create purchase data by Gender data frame
data_by_gender_df = purchase_data_df.groupby('Gender')

In [140]:
#Number of unique players by gender
players_by_gender = data_by_gender_df.nunique()["SN"]
players_by_gender

Gender
Female                    81
Male                     484
Other / Non-Disclosed     11
Name: SN, dtype: int64

In [143]:
#Total purchases by gender
G_purchases = data_by_gender_df["Purchase ID"].count()
G_purchases

Gender
Female                   113
Male                     652
Other / Non-Disclosed     15
Name: Purchase ID, dtype: int64

In [147]:
#Average purchase price by gender
G_avg_purchase_price = data_by_gender_df["Price"].mean()
G_avg_purchase_price

Gender
Female                   3.203009
Male                     3.017853
Other / Non-Disclosed    3.346000
Name: Price, dtype: float64

In [148]:
#Average purchase total by gender
G_avg_purchase_total = data_by_gender_df["Price"].sum()
G_avg_purchase_total

Gender
Female                    361.94
Male                     1967.64
Other / Non-Disclosed      50.19
Name: Price, dtype: float64

In [149]:
#Average purchase total divided by purchases per unique player
avg_purchase_by_player = G_avg_purchase_total/players_by_gender

In [150]:
#Data frame for summary of data
gender_data_summary_df = pd.DataFrame({"Purchase Count": G_purchases,
"Average Purchase Price": G_avg_purchase_price,
"Average Purchase Value": G_avg_purchase_total,
"Avg Purchase Total per Person": avg_purchase_by_player})

In [152]:
#Format Data Frame
gender_data_summary_df.index.name = "Gender"
gender_data_summary_df.style.format({"Average Purchase Value":"${:,.2f}","Average Purchase Value":"${:,.2f}", "Avg Purchase Total per Person":"${:,.2f}"})

## Age Demographics

* Establish bins for ages


* Categorize the existing players using the age bins. Hint: use pd.cut()


* Calculate the numbers and percentages by age group


* Create a summary data frame to hold the results


* Optional: round the percentage column to two decimal points


* Display Age Demographics Table

In [83]:
#Creating bins for ages
bins = [0, 9.9, 14.9, 19.9, 23.9, 28.9, 34.9, 39.9, 120]
group_names = ["<10", "10-14", "15-19", "20-24", "25-29", "30-34", "35-39", "40+"]

In [153]:
#Creating new category of Age Summary using bins
player_purchases_by_age_df= purchase_data_df
player_purchases_by_age_df["Age Groups"] = pd.cut(player_purchases_by_age_df['Age'], bins, labels=group_names)
player_purchases_by_age_df

,Purchase ID,SN,Age,Gender,Item ID,Item Name,Price,Age Groups
0,0,Lisim78,20,Male,108,"Extraction, Quickblade Of Trembling Hands",3.53,20-24
1,1,Lisovynya38,40,Male,143,Frenzied Scimitar,1.56,40+
2,2,Ithergue48,24,Male,92,Final Critic,4.88,25-29
3,3,Chamassasya86,24,Male,100,Blindscythe,3.27,25-29
4,4,Iskosia90,23,Male,131,Fury,1.44,20-24
...,...,...,...,...,...,...,...,...
775,775,Aethedru70,21,Female,60,Wolf,3.54,20-24
776,776,Iral74,21,Male,164,Exiled Doomblade,1.63,20-24
777,777,Yathecal72,20,Male,67,"Celeste, Incarnation of the Corrupted",3.46,20-24
778,778,Sisur91,7,Male,92,Final Critic,4.19,<10
779,779,Ennrian78,24,Male,50,Dawn,4.60,25-29

In [154]:
#Group by age groups
age_groups = purchase_data_df.groupby("Age Groups")

In [155]:
#Number of players per age group
players_per_age_group = age_groups["SN"].nunique()
players_per_age_group

Age Groups
<10       17
10-14     22
15-19    107
20-24    210
25-29    115
30-34     62
35-39     31
40+       12
Name: SN, dtype: int64

In [157]:
#Percentage of players in each age group
percentage_players_per_age_group = (players_per_age_group/player_count) *100
percentage_players_per_age_group

Age Groups
<10       2.951389
10-14     3.819444
15-19    18.576389
20-24    36.458333
25-29    19.965278
30-34    10.763889
35-39     5.381944
40+       2.083333
Name: SN, dtype: float64

In [158]:
#Data frame of Age group values
age_stats = pd.DataFrame({"Percentage of Players": percentage_players_per_age_group, "Total Count": players_per_age_group})
age_stats

            Percentage of Players  Total Count
Age Groups
<10                      2.951389           17
10-14                    3.819444           22
15-19                   18.576389          107
20-24                   36.458333          210
25-29                   19.965278          115
30-34                   10.763889           62
35-39                    5.381944           31
40+                      2.083333           12

In [160]:
#Formatting for age stats
age_stats.style.format({"Percentage of Players": "{:,.2f}%"})

       Total Count Percentage of Players
<10             17                 2.95%
10-14           22                 3.82%
15-19          107                18.58%
20-24          258                44.79%
25-29           77                13.37%
30-34           52                 9.03%
35-39           31                 5.38%
40+             12                 2.08%

## Purchasing Analysis (Age)

* Bin the purchase_data data frame by age


* Run basic calculations to obtain purchase count, avg. purchase price, avg. purchase total per person etc. in the table below


* Create a summary data frame to hold the results


* Optional: give the displayed data cleaner formatting


* Display the summary data frame

In [161]:
#Purchases by age group
A_purchase_count = age_groups["Purchase ID"].count()
A_purchase_count

Age Groups
<10       23
10-14     28
15-19    136
20-24    298
25-29    155
30-34     86
35-39     41
40+       13
Name: Purchase ID, dtype: int64

In [162]:
#Average purchase amount by age group
A_avg_purchase_price = age_groups["Price"].mean()
A_avg_purchase_price

Age Groups
<10      3.353478
10-14    2.956429
15-19    3.035956
20-24    3.033020
25-29    3.019290
30-34    2.898023
35-39    3.601707
40+      2.941538
Name: Price, dtype: float64

In [164]:
#Total purchase amount by age group
A_total_purchase_amount = age_groups["Price"].sum()
A_total_purchase_amount

Age Groups
<10       77.13
10-14     82.78
15-19    412.89
20-24    903.84
25-29    467.99
30-34    249.23
35-39    147.67
40+       38.24
Name: Price, dtype: float64

In [165]:
#Average purchase per player
A_avg_purchase_per_player = A_total_purchase_amount/players_per_age_group
A_avg_purchase_per_player

Age Groups
<10      4.537059
10-14    3.762727
15-19    3.858785
20-24    4.304000
25-29    4.069478
30-34    4.019839
35-39    4.763548
40+      3.186667
dtype: float64

In [166]:
#Data frame to display data
age_purchasing_data_df= pd.DataFrame({"Purchase Count": A_purchase_count,
"Average Purchase Price": A_avg_purchase_price,
"Total Purchase Value": A_total_purchase_amount,
"Average Purchase Total per Person": A_avg_purchase_per_player})

In [167]:
#Formatting Data
age_purchasing_data_df.style.format({"Average Purchase Price": "${:,.2f}", "Total Purchase Value":"${:,.2f}", "Average Purchase Total per Person": "${:,.2f}"})

,Purchase Count,Average Purchase Price,Total Purchase Value,Avg Total Purchase per Person
Age Ranges,,,,
<10,23,$3.35,$77.13,$4.54
10-14,28,$2.96,$82.78,$3.76
15-19,136,$3.04,$412.89,$3.86
20-24,365,$3.05,"$1,114.06",$4.32
25-29,101,$2.90,$293.00,$3.81
30-34,73,$2.93,$214.00,$4.12
35-39,41,$3.60,$147.67,$4.76
40+,13,$2.94,$38.24,$3.19

## Top Spenders

* Run basic calculations to obtain the results in the table below


* Create a summary data frame to hold the results


* Sort the total purchase value column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

In [168]:
#Purchase data by screen name
top_spenders = purchase_data_df.groupby("SN")

In [170]:
#Total purchase count by screen name
S_purchase_count = top_spenders["Purchase ID"].count()
S_purchase_count

SN
Adairialis76     1
Adastirin33      1
Aeda94           1
Aela59           1
Aelaria33        1
                ..
Yathecal82       3
Yathedeu43       2
Yoishirrala98    1
Zhisrisu83       2
Zontibe81        3
Name: Purchase ID, Length: 576, dtype: int64

In [171]:
#Average purchase price per screen name
S_avg_purchase_price = top_spenders["Price"].mean()
S_avg_purchase_price

SN
Adairialis76     2.280000
Adastirin33      4.480000
Aeda94           4.910000
Aela59           4.320000
Aelaria33        1.790000
                   ...
Yathecal82       2.073333
Yathedeu43       3.010000
Yoishirrala98    4.580000
Zhisrisu83       3.945000
Zontibe81        2.676667
Name: Price, Length: 576, dtype: float64

In [172]:
#Purchase total per screen name
S_purchase_total = top_spenders["Price"].sum()
S_purchase_total

SN
Adairialis76     2.28
Adastirin33      4.48
Aeda94           4.91
Aela59           4.32
Aelaria33        1.79
                 ...
Yathecal82       6.22
Yathedeu43       6.02
Yoishirrala98    4.58
Zhisrisu83       7.89
Zontibe81        8.03
Name: Price, Length: 576, dtype: float64

In [173]:
#Data frame for screen name data
top_spenders_df = pd.DataFrame({"Purchase Count": S_purchase_count, "Average Purchase Price": S_avg_purchase_price, "Total Purchase Value": S_purchase_total})

In [175]:
#Format data frame into descending order from highest spender
clean_top_spenders_df = top_spenders_df.sort_values(["Total Purchase Value"], ascending=False).head()

In [176]:
#Format data with correct rounding and symbols
clean_top_spenders_df.style.format({"Average Purchase":"${:,.2f}",
"Average Purchase Price":"${:,.2f}",
"Total Purchase Value":"${:,.2f}"})

             Purchase Count Average Purchase Price Total Purchase Value
SN
Lisosia93                 5                  $3.79               $18.96
Idastidru52               4                  $3.86               $15.45
Chamjask73                3                  $4.61               $13.83
Iral74                    4                  $3.40               $13.62
Iskadarya95               3                  $4.37               $13.10

## Most Popular Items

* Retrieve the Item ID, Item Name, and Item Price columns


* Group by Item ID and Item Name. Perform calculations to obtain purchase count, average item price, and total purchase value


* Create a summary data frame to hold the results


* Sort the purchase count column in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the summary data frame

In [179]:
#Create new data frame with desired columns
items_df= purchase_data_df[["Item ID", "Item Name", "Price"]]
items_df

     Item ID                                  Item Name  Price
0        108  Extraction, Quickblade Of Trembling Hands   3.53
1        143                          Frenzied Scimitar   1.56
2         92                               Final Critic   4.88
3        100                                Blindscythe   3.27
4        131                                       Fury   1.44
..       ...                                        ...    ...
775       60                                       Wolf   3.54
776      164                           Exiled Doomblade   1.63
777       67      Celeste, Incarnation of the Corrupted   3.46
778       92                               Final Critic   4.19
779       50                                       Dawn   4.60

[780 rows x 3 columns]

In [182]:
#Grouping the item data
item_info = items_df.groupby(["Item ID", "Item Name"])

In [184]:
#Purchase counts per item
item_purchase_count = item_info["Price"].count()
item_purchase_count

Item ID  Item Name
0        Splinter                                         4
1        Crucifer                                         4
2        Verdict                                          6
3        Phantomlight                                     6
4        Bloodlord's Fetish                               5
                                                         ..
178      Oathbreaker, Last Hope of the Breaking Storm    12
179      Wolf, Promise of the Moonwalker                  6
181      Reaper's Toll                                    5
182      Toothpick                                        3
183      Dragon's Greatsword                              3
Name: Price, Length: 179, dtype: int64

In [187]:
#Purchase value per item
purchase_value = (item_info["Price"].sum())
purchase_value

Item ID  Item Name
0        Splinter                                         5.12
1        Crucifer                                        11.77
2        Verdict                                         14.88
3        Phantomlight                                    14.94
4        Bloodlord's Fetish                               8.50
                                                         ...
178      Oathbreaker, Last Hope of the Breaking Storm    50.76
179      Wolf, Promise of the Moonwalker                 26.88
181      Reaper's Toll                                    8.30
182      Toothpick                                       12.09
183      Dragon's Greatsword                              3.27
Name: Price, Length: 179, dtype: float64

In [188]:
#Price of individual items
item_price = purchase_value/item_purchase_count
item_price

Item ID  Item Name
0        Splinter                                        1.2800
1        Crucifer                                        2.9425
2        Verdict                                         2.4800
3        Phantomlight                                    2.4900
4        Bloodlord's Fetish                              1.7000
                                                          ...
178      Oathbreaker, Last Hope of the Breaking Storm    4.2300
179      Wolf, Promise of the Moonwalker                 4.4800
181      Reaper's Toll                                   1.6600
182      Toothpick                                       4.0300
183      Dragon's Greatsword                             1.0900
Name: Price, Length: 179, dtype: float64

In [189]:
#Data Frame for item info
most_popular_items_df = pd.DataFrame({"Purchase Count": item_purchase_count,
"Item Price": item_price,
"Total Purchase Value": purchase_value})

In [190]:
#Decending order for data clarity
formatted_most_popular_items_df = most_popular_items_df.sort_values(["Purchase Count"], ascending=False).head()

In [198]:
#Adding symbols and rounding
formatted_most_popular_items_df.style.format({"Item Price":"${:,.2f}", "Total Purchase Value":"${:,.2f}"})

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
92,Final Critic,13,$4.61,$59.99
178,"Oathbreaker, Last Hope of the Breaking Storm",12,$4.23,$50.76
145,Fiery Glass Crusader,9,$4.58,$41.22
132,Persuasion,9,$3.22,$28.99
108,"Extraction, Quickblade Of Trembling Hands",9,$3.53,$31.77

## Most Profitable Items

* Sort the above table by total purchase value in descending order


* Optional: give the displayed data cleaner formatting


* Display a preview of the data frame

In [195]:
#Sorting by total purchase value in descending order
formatted_most_popular_items_df = most_popular_items_df.sort_values(["Total Purchase Value"], ascending=False).head()

In [199]:
formatted_most_popular_items_df.style.format({"Item Price":"${:,.2f}", "Total Purchase Value":"${:,.2f}"})

,,Purchase Count,Item Price,Total Purchase Value
Item ID,Item Name,,,
92,Final Critic,13,$4.61,$59.99
178,"Oathbreaker, Last Hope of the Breaking Storm",12,$4.23,$50.76
82,Nirvana,9,$4.90,$44.10
145,Fiery Glass Crusader,9,$4.58,$41.22
103,Singed Scalpel,8,$4.35,$34.80